# encoding: cp1251

# Задача-1:
# Дан список заполненный произвольными целыми числами, получите новый список элементами которого будут
# квадратные корни элементов исходного списка, но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

print([int(elem ** 0.5) for elem in [2, -5, 8, 9, -25, 25, 4] if elem > 0 and elem ** 0.5 % 1 == 0])
# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

day = ['первое', 'второе', 'третье', 'четвертое', 'пятое', 'шестое', 'седьмое', 'восьмое', 'девятое', 'десятое', 
       'одиннадцатое', 'двенадцатое', 'тринадцатое', 'четырнадцатое', 'пятнадцатое', 'шестнадцатое', 'семнадцатое', 
       'восемнадцатое', 'девятнадцатое', 'двадцатое', 'двадвать первое', 'двадцать второе', 'двадцать третье', 
       'двадцать четвертое', 'двадцать пятое', 'двадцать шестое', 'двадцать седьмое', 'двадцать восьмое', 
       'двадцать девятое', 'тридцатое', 'тридцать первое']

month = ['января', 'февраля', 'марта', 'апреля', 'мая', 'июня', 'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря']
s = [int item for item in '02.11.2013'.split('.')]
print(format('{} {} {} года', day[s[0] - 1], month[s[1] - 1], s[2]))

# Задача-3: Напишите алгоритм заполняющий список произвольными целыми числами в диапазоне от -100 до 100
# В списке должно быть n - элементов
# Подсказка: для получения случайного числа изпользуйте функцию randint() модуля random

from random import randint
n = int(input('Input n:'))
arr = [randint(-100, 100) for item in range(n)]
print(arr)

# Задача-4: Дан список заполненный произвольными целыми числами
# Получите новый список, элементами которого будут только уникальные элементы исходного

print(list(set(arr)))
